static byte num = 0;
void setup() {
DDRD = B11111111; // піни портів D (на платі 0-7 піни) і
DDRB = B111111; // B (на платі 8-13 піни) позначаєм вихідними
PORTB = B111111; // встановлюємо високий рівень пінів порта В (на платі 8-13 піни)
}
void loop() {
PORTB |= ~PORTB; //PORTB = B111111; // встановлюємо високий рівень на пінах 8-13 порта В
PORTB &= ~(1<<num); //PORTB = B111110; // встановлюємо низький рівень 8 піна порта В при num=0
num++;
num %= 4;
PORTD = B00111111; // нуль у порт D
delay(200); // пауза півсекунди
PORTD = B00000110; // одиницю у порт D
delay(200);
PORTD = B01011011; // двійку у порт D
delay(200);
PORTD = B01001111; // трійку у порт D
delay(200);
PORTD = B01100110; // четвірку у порт D
delay(200);
PORTD = B01101101; // п'ятірку у порт D
delay(200);
PORTD = B01111101; // шестірку у порт D
delay(200);
PORTD = B00000111; // семірку у порт D
delay(200);
PORTD = B01111111; // вісімку у порт D
delay(200);
PORTD = B01101111; // дев'ятку у порт D
delay(200);
PORTD = B10000000; // крапка у порт D
delay(200);
}
